app/Controllers/User.php

    public function index() {


        $data = [
            'title' => 'Data User',
            'dataUser' => $this->userModel->findAll()
---
SELECT *
FROM `user`

            return redirect()->to('/user/tambah')->withInput()->with('validation', $data);
        } else {
            $data = $this->request->getPost();
            $this->userModel->withGroup()->save($data);
---
INSERT INTO `user` (`nama_user`, `username`, `jabatan`, `password`, `created_at`, `updated_at`) VALUES ('fredddd', 'fredikstefan', 'pendamping', '12345678', '2022-11-12 10:24:20', '2022-11-12 10:24:20')