app/Controllers/Warga.php

INSERT INTO `warga` (`jenis_bantuan`, `periode`, `tahun`, `nama_lengkap`, `jenis_kelamin`, `tanggal_lahir`, `no_nik`, `no_kk`, `pendidikan`, `pekerjaan`, `penghasilan`, `no_rek`, `no_telepon`, `alamat`, `rt_rw`, `desa`, `kecamatan`, `kabupaten`, `provinsi`, `kode_pos`, `jumlah_anak`, `jumlah_sd`, `jumlah_smp`, `jumlah_sma`, `jumlah_balita`, `jumlah_disabilitas`, `jumlah_lansia`, `pendamping`, `created_at`, `updated_at`) VALUES ('2', 'Periode 1', '2021', 'Et reprehenderit te', 'Perempuan', '2015-06-20', '18', '9', 'Dolores maiores volu', 'Veniam voluptatum q', '76', '19', '21', 'Aut cum impedit ea ', 'Ut laboriosam sit m', 'Omnis esse eveniet ', 'Dolorum iusto in sae', 'Rerum est placeat ', 'Recusandae Sit non ', '12', '54', '66', '4', '44', '94', '18', '54', '1', '2022-11-19 06:44:25', '2022-11-19 06:44:25')
---
    public function add() {
        $data = $this->request->getPost();
        $this->wargaModel->save($data);