app/Models/Coba.php

    function searchAndDisplay($katakunci = null, $start = 0, $length = 0) {
        if ($katakunci) {
            $arr_katakunci = explode(" ", $katakunci);
            for ($i = 0; $i < count($arr_katakunci); $i++) {
                $this->orLike('username', $arr_katakunci[$i]);
                $this->orLike("alamat", $arr_katakunci[$i]);
            }
        }

        if ($start != 0 or $length != 0) {
            $this->limit($length, $start);
        }

        return $this->orderBy("username")->get()->getResult();
---
SELECT *
FROM `coba`
ORDER BY `username`